package cli.backend.userinterface;

import cli.backend.textformatters.Color;

public class StartMenu extends Menu{

    private static final String LOGO =
    Color.textBrightMagenta("██████╗ ███████╗██╗  ████████╗ █████╗ ███████╗██████╗  █████╗  ██████╗███████╗\n") +
    Color.textMagenta("██╔══██╗██╔════╝██║  ╚══██╔══╝██╔══██╗██╔════╝██╔══██╗██╔══██╗██╔════╝██╔════╝\n") +
    Color.textBlue("██║  ██║█████╗  ██║     ██║   ███████║███████╗██████╔╝███████║██║     █████╗\n") +
    Color.textBrightBlue("██║  ██║██╔══╝  ██║     ██║   ██╔══██║╚════██║██╔═══╝ ██╔══██║██║     ██╔══╝\n") +
    Color.textCyan("██████╔╝███████╗███████╗██║   ██║  ██║███████║██║     ██║  ██║╚██████╗███████╗\n") +
    Color.textBrightCyan("╚═════╝ ╚══════╝╚══════╝╚═╝   ╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝  ╚═╝ ╚═════╝╚══════╝");

    @Override
    public void showMenu(){
        System.out.println(LOGO);
        System.out.println("\n--- Welcome to Deltaspace platform ---");
        System.out.println("1. Register");
        System.out.println("2. Login");
        System.out.println("3. Quit");
    }
}
